# AngularDimensionTextPosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..AngularDimensionTextPosition Property
RebarBendingDetailType Class See Also
---
Identifies the text position with respect to dimension line.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionTextPosition As BendingDetailDimensionTextPosition
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailDimensionTextPosition AngularDimensionTextPosition {
	BendingDetailDimensionTextPosition get ();
	void set (BendingDetailDimensionTextPosition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace